export const API = "https://simple-scene-api.vercel.app/"; //http://localhost:5000";

// Индексы вершин для граней
export const indices = [
  0, 2, 1, 2, 3, 1,
  4, 6, 5, 6, 7, 5,
  8, 10, 9, 10, 11, 9,
  12, 14, 13, 14, 15, 13,
  16, 18, 17, 18, 19, 17,
  20, 22, 21, 22, 23, 21
];

// Нормали
export const normals = new Float32Array([
  1, 0, 0,
  1, 0, 0,
  1, 0, 0,
  1, 0, 0,
  -1, 0, 0,
  -1, 0, 0,
  -1, 0, 0,
  -1, 0, 0,
  0, 1, 0,
  0, 1, 0,
  0, 1, 0,
  0, 1, 0,
  0, -1, 0,
  0, -1, 0,
  0, -1, 0,
  0, -1, 0,
  0, 0, 1,
  0, 0, 1,
  0, 0, 1,
  0, 0, 1,
  0, 0, -1,
  0, 0, -1,
  0, 0, -1,
  0, 0, -1
]);

// UV-координаты (при добавлении текстуры нуждаются в изменении)
export const uvArray = new Float32Array([
  0, 1, 1, 1, 0, 0, 1, 0,
  0, 1, 1, 1, 0, 0, 1, 0,
  0, 1, 1, 1, 0, 0, 1, 0,
  0, 1, 1, 1, 0, 0, 1, 0,
  0, 1, 1, 1, 0, 0, 1, 0,
  0, 1, 1, 1, 0, 0, 1, 0
]);